#. Дано целое число N (>0). С помощью операций деления нацело и взятия остатка от
#деления определить, имеется ли в записи числа N цифра «2». Если имеется, то
#вывести TRUE, если нет — вывести FALSE.
N = input("Введите целое число больше 0: ")
while type(N) != int : #обработка исключений 1
    try:
        N = int(N)
    except ValueError:
        print("Ошибка, попробуйте снова")
        N = input("Введите целое число больше 0: ")
while N <= 0 : #обработка исключений 2
    try:
        N = int(input("Введите целое число больше 0: "))
        if N <= 0:
            print("Ошибка, введите число больше 0.")
    except ValueError:
        print("Ошибка, попробуйте снова")
while N > 0: #Выполнение задачи
    b = N%10
    if b == 2:
        print("TRUE")
        break
    else:
        N //= 10
if N == 0:
    print("FALSE")
