#Вариант 3. Скорость лодки в стоячей воде V км/ч, скорость течения реки U км/ч.
#(U < V). Время движения лодки по озеру T1 ч, а по реке (против течения) — T2 ч. Определить путь S, пройденный лодкой (путь = время • скорость). Учесть, что при движении против
#течения скорость лодки уменьшается на величину скорости течения.
try:
    V = int(input("Введите скорость лодки в стоячей воде: ")) #вводим переменную скорости лодки
    U = int(input("Введите скорость течения реки: ")) #вводим переменную скорости течения
    T1 = int(input("Введите время движения лодки по течению: ")) #вводим переменную времени движения лодки по течению
    T2 = int(input("Введите время движения лодки против течения: ")) #вводим переменную времени движения лодки против течения
    if U < V: #проверяем условие, заданное в задаче
        S1 = (V + U)*T1 #считаем путь, пройденный по течению
        S2 = (V - U)*T2 #считаем путь, пройденный против течения
        S = S1 + S2 #считаем общий путь, сложив два пути: по и против течения
        print("Ответ: Общий путь, пройденный лодкой равен", S) #Выводим ответ в консоль
        a = input()
    else: #Если условие не совпадает с условием в задаче
        print("Скорость течения реки выше или равна скорости лодки, измените данные")
        a = input()
except ValueError:  #Если были введены не числовые значения
    print("Значения написаны не в том формате, пожалуйста, напишите в целочисленном формате")
    a = input()