#2. Размер скидки на продукты определен следующим образом: при покупке до 500 р.
#скидка составит 2%; при покупке от 500 р. до 1000 р. скидка составит 3%; при
#покупке от 1000 р. до 1500 р. скидка составит 4%; при покупке от 1500 р. до 2000 р.
#скидка составит 5%. Составить программу определяющую размер скидки в
#зависимости от потраченной суммы.
try: #Обработка исключений
    Sum = int(input("Введите потраченную сумму: ")) #Ввод потраченной суммы
    if Sum < 500: #Проверка условия
        print("Ваша скидка составит 2%")
    elif 500 <= Sum < 1000: #Проверка условия
        print("Ваша скидка составит 3%")
    elif 1000 <= Sum < 1500: #Проверка условия
        print("Ваша скидка составит 4%")
    elif 1500 <= Sum < 2000: #Проверка условия
        print("Ваша скидка составит 5%")
    else:
        print("Скидка не предусмотрена")
except ValueError:
    print("Ошибка, попробуйте снова")